Show / Hide Table of Contents
Class ConcreteCheckResults
Concrete Check results
Inheritance
System.Object
ConcreteCheckResults
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ConcreteCheckResults
Constructors
Improve this Doc   View Source
ConcreteCheckResults()
Constructor
Declaration
public ConcreteCheckResults()
Properties
Improve this Doc   View Source
CheckResults
All results
Declaration
public List<ConcreteCheckResult> CheckResults { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ConcreteCheckResult>
Improve this Doc   View Source
Overall
Overal check
Declaration
public ConcreteCheckResultOverall Overall { get; set; }
Property Value
 Type |  Description
 ConcreteCheckResultOverall
 Improve this Doc
 View Source